#define _CRT_SECURE_NO_DEPRECATE
#include <stdio.h>
#include <locale.h>

int main()
{
	setlocale(LC_CTYPE, "RUS");
	float a, b;

	printf("Введите два числа:");
	scanf("%f %f", &a, &b);

	puts("  _______________________________________________________________________________");
	puts("  |          a*b          |          a+b          |          a-b          |");
	puts("  _______________________________________________________________________________");
	printf("  |%11g*%11g|%11g+%11g|%11g-%11g|\n", a, b, a, b, a, b);
	puts("  _______________________________________________________________________________");
	printf("  | %21g | %21g | %21g |", a * b, a + b, a - b);

	return 0;
}
